app/models/sales_order.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."product_name" = $1 LIMIT $2  [["product_name", "Phenol"], ["LIMIT", 1]]
---
  def deduct_inventory
    liters = quantity_ordered_liters.to_f
    return unless liters > 0
    inv = Inventory.find_by(product_name: product_name)